/*
 Localizable.strings
 BugReporterTest
 
 Created by charles Samuel DMonte on 15/11/16.
 Copyright © 2016 Giridhar. All rights reserved.
 */

"zanalytics.bug.alert.withscreenshot" = "With screenshot";
"zanalytics.bug.alert.withscreenrecord" = "With screen recording";


"zanalytics.bug.alert.about" = "About";
"zanalytics.bug.alert.from" = "From";
"zanalytics.bug.alert.imagelimitreached" = "Maximum limit reached";
"zanalytics.bug.alert.imagelimits" = "You can attach only up to 10 images.";
"zanalytics.bug.alert.macheader" = "Share feedback with us or report bugs along with
attachments for our reference.";
"zanalytics.bug.alert.write" = "Write to us";
"zanalytics.bug.alert.recordedclip" = "Recorded clips";

"zanalytics.bug.alert.anonymalert" = "It is always recommended to share feedback with your email address. If you do not share your email address, we won't be able to reach you to update about the issue.";

"zanalytics.bug.alert.quitfeedback" = "Are you sure you want to leave?";
"zanalytics.feedback.navbar.title.feedback"  = "Feedback";
"zanalytics.feedback.navbar.title.noscreenshots" = "No screenshots available";
"zanalytics.feedback.navbar.title.screenshots" = "Screenshots";
"zanalytics.feedback.navbar.title.snap" = "Snap";
"zanalytics.feedback.navbar.title.compose" = "Compose";
"zanalytics.feedback.privacy.consent.cancel" = "Cancel";
"zanalytics.feedback.navbar.button.title.done" = "Done";





"zanalytics.bug.alert.cancel"               = "Nope";
"zanalytics.bug.alert.title"                = "Want to tell us something?";
"zanalytics.feedback.navbar.title.reportbug"            = "Report bug";
"zanalytics.feedback.navbar.title.helpme"               = "Help me";

"zanalytics.feedback.navbar.title.systemlogs"             = "System Logs personal";

"zanalytics.feedback.navbar.title.diagnosticinfo"             = "Diagnostic Information";

"zanalytics.bug.alert.dontshowagain"            = "Don't show again";
"zanalytics.bug.alert.title.helpme"            = "Help me";

"zanalytics.bug.alert.message.savetolocal"         = "Sorry.. We couldn't send the bug report, do you want to save the screenshot?";



"zanalytics.feedback.email.title"                = "Email address";


"zanalytics.bug.detectscreen.title"       = "Found something interesting?";

"zanalytics.bug.alert.detectscreen.yes"                      = "Yes";
"zanalytics.bug.alert.detectscreen.no"                       = "No";

"zanalytics.bug.alert.detectscreen.share" = "Share";
"zanalytics.bug.alert.detectscreen.dontshow" = "Don\'t ask again";

"zanalytics.bug.annotate.button.title"                       = "Annotate the bug using the tools below";


"zanalytics.feedback.failed.alert.description" = "Failed to send feedback, please try again!";


"zanalytics.feedback.success.alert.description" = "Thank you for submitting your feedback!";


"zanalytics.feedback.common.alert.title.add.photos" = "Add Photos";
"zanalytics.feedback.common.alert.title.alert" = "Alert";
"zanalytics.feedback.common.button.title.back" = "Back";
"zanalytics.feedback.common.button.title.cancel" = "Cancel";
"zanalytics.feedback.common.button.title.close" = "Close";
"zanalytics.feedback.common.button.title.ok" = "Ok";
"zanalytics.feedback.textview.placeholder" = "We value your feedback. Please let us know how we're doing.";
"zanalytics.bug.textview.placeholder" = "Did you run into any trouble while using our app? Let us know.";
"zanalytics.help.textview.placeholder" = "We will try to make things right and help you out!";
"zanalytics.feedback.add.photos.alert.description" = "No photos attached, open photo gallery to add more photos!";
"zanalytics.feedback.add.photos.alert.open" = "Open Photos";
"zanalytics.feedback.access.photos.alert.description" = "%@ app does not have access to your photos.\nTo enable access, go to: Settings > Privacy > Photos > %@";
"zanalytics.feedback.access.photos.alert.settings" = "Settings";
"zanalytics.feedback.label.title.anonymous" = "Anonymous";
"zanalytics.feedback.navbar.button.title.send" = "Send";
"zanalytics.feedback.navbar.button.title.next" = "Next";
"zanalytics.feedback.navbar.button.title.editphotos" = "Edit Photos";
"zanalytics.feedback.navbar.button.title.addmore" = "Add More";
"zanalytics.feedback.navbar.button.title.attach" = "Attach";
"zanalytics.feedback.navbar.button.title.delete" = "Delete";
"zanalytics.feedback.navbar.title.taptoedit" = "Tap To Edit";
"zanalytics.feedback.navbar.title.editor" = "Editor";
"zanalytics.feedback.navbar.title.choosephotos" = "Choose Photos";
"zanalytics.feedback.navbar.title.selectphotos" = "Select Photos";
"zanalytics.feedback.navbar.title.photoselected" = "Photo Selected";
"zanalytics.feedback.navbar.title.photosselected" = "Photos Selected";
"zanalytics.feedback.accessory.title.systemlogs" = "Include System Logs";
"zanalytics.feedback.accessory.title.systemkeylogs" = "Include System Key Logs";
"zanalytics.feedback.accessory.title.diagnosticinfo" = "Include Diagnostic Information";
"zanalytics.feedback.accessory.button.title.view" = "View";
"zanalytics.feedback.picker.image.notfound" = "Images Not Found";
"zanalytics.feedback.attachments.title" = "Attachments";
"zanalytics.feedback.privacy.consent.description" = "We recommend you include the console log and the diagnostic info as it will help our developers better understand the feedback you are sharing.";
"zanalytics.feedback.privacy.consent.clogs.title" = "Console Logs";
"zanalytics.feedback.privacy.consent.dinfo.title" = "Diagnostic Info";
"zanalytics.feedback.privacy.consent.otherinfo.title" = "Other Info";
"zanalytics.feedback.privacy.consent.deviceinfo.title" = "Device Info";
"zanalytics.feedback.privacy.consent.openmailapp" = "Open in mail";
"zanalytics.feedback.crash.sendcrash.alwayssend" = "Always send";




// Issue Recording VC
"issuerecordscreen.label.recordissue" = "Record Your Issue";
"issuerecordscreen.label.close" = "Close";
"issuerecordscreen.label.failedtoinitiate" = "Failed to intiate the screen recording";
"issuerecordscreen.label.failuremultiwindow" = "The content you are trying to record is in multi-window mode, which is not supported for recording. Please switch to full-screen mode";
"issuerecordscreen.label.nointerneterror" = "Internet connection required for screen recording. Please connect to proceed.";
"issuerecordscreen.label.ok" = "OK";
"issuerecordscreen.label.recordinginfo" = "Quickly record the issues you face and send them to our support team for easy understanding and quick assistance.";
"issuerecordscreen.label.iagreetext" = "I agree and consent to the collection of the required data. View Details";
"issuerecordscreen.label.optiontotrim" = "You have an option to trim, edit and annotate the recorded video.";
"issuerecordscreen.label.startrecording" = "Start Recording";
"issuerecordscreen.label.endrecording" = "End Recording";
"issuerecordscreen.label.recordinginprogress" = "Recording In Progress!";
"issuerecordscreen.label.quicktipstext" = "Quick Tips";
"issuerecordscreen.label.quicktips1" = "You can record your screen for a maximum of 5 minutes.";
"issuerecordscreen.label.quicktips2" = "You can trim, edit and annotate the recorded video.";
"issuerecordscreen.label.quicktips3" = "Do not close the app when the screen is being recorded.";
"issuerecordscreen.label.quicktips4" = "To learn more, please visit our help documentation";

// Data Consent Screen
"dataconsentscreen.label.consenttitle" = "The following data will be collected upon your consent:";
"dataconsentscreen.label.consent1" = "Your IP address and that are generated during the recording";
"dataconsentscreen.label.consent2" = "Your environment details suсh as device name, OS version, etc.";
"dataconsentscreen.label.consent3" = "Device performance metrics (such as memory, network connection time, etc.)";
"dataconsentscreen.label.consent4" = "The screen recording of the device window";
"dataconsentscreen.label.consent5" = "By default, the audio will be recorded during the screen recording. But you can mute or re-record the audio track before submitting it.";

// Permission
"videoannotationscreen.alert.microphonedisabledipad" = "Access to Microphone is disabled";
"videoannotationscreen.alert.gotosettingtoturnonmicrophoneipad" = "Please go to Settings and turn on Microphone to record audio.";
"videoannotationscreen.alert.microphonedisablediphone" = "Access to Microphone is disabled. Please go to Settings and turn on Microphone to record audio.";

// General
"general.label.recordingintiationfailed" = "Screen recording initiation failed. Please try again";
"general.label.ok" = "Ok";
"general.label.submit" = "Submit";
"general.label.done" = "Done";
"general.label.cancel" = "Cancel";
"general.label.settings" = "Settings";
"general.label.erroroccured" = "Error Occured";

// Issue Submission Screen
"issuesubmissionscreen.alert.filesizeexceeded" = "File size has exceeded. The file size should not exceed more than 3 MB";
"issuesubmissionscreen.label.attachfiles" = "Attach Files";
"issuesubmissionscreen.label.newrecording" = "New Recording";
"issuesubmissionscreen.label.editrecording" = "Edit Recording";


// Video Annotation Screen
"videoannotationscreen.label.noaudiotrack" = "No Audio Track";
"videoannotationscreen.label.shapeborderwidth" = "Border Width";
"videoannotationscreen.label.shapelineopacity" = "Opacity";
"videoannotationscreen.label.shapetextsize" = "Text Size";
"videoannotationscreen.alert.elementdurationbeyondvideolength" = "Element duration is beyond the video length";
"videoannotationscreen.alert.notallowed" = "Not Allowed";
"videoannotationscreen.alert.deleteexisitingaudio" = "Please delete the existing audio before recording the new one.";
"videoannotationscreen.alert.textlimitreached" = "Limit Reached";
"videoannotationscreen.alert.textdeleteexisting" = "Please delete some of the existing text.";
"videoannotationscreen.alert.pausevideobeforerecordingaudio" = "Please pause your video before recording audio";
"videoannotationscreen.alert.changesnotsaved" = "Your changes are not saved. Are you sure you want to proceed?";
"videoannotationscreen.alert.proceed" = "Proceed";
"videoannotationscreen.alert.stroketypesolid" = "Solid";
"videoannotationscreen.alert.stroketypedashed" = "Dashed";
"videoannotationscreen.alert.entertext" = "Enter the text";

"videoannotationscreen.label.trim" = "Trim";
"videoannotationscreen.label.mask" = "Mask";
"videoannotationscreen.label.shapes" = "Shapes";
"videoannotationscreen.label.text" = "Text";
"videoannotationscreen.label.audio" = "Audio";
"videoannotationscreen.label.block" = "Block";
"videoannotationscreen.label.blur" = "Blur";
"videoannotationscreen.label.rectangle" = "Rectangle";
"videoannotationscreen.label.oval" = "Oval";
"videoannotationscreen.label.arrow" = "Arrow";
"videoannotationscreen.label.color" = "Color";
"videoannotationscreen.label.width" = "Width";
"videoannotationscreen.label.style" = "Style";
"videoannotationscreen.label.edit" = "Edit";
"videoannotationscreen.label.size" = "Size";
"videoannotationscreen.label.background" = "Background";
"videoannotationscreen.label.textregular" = "Regular";
"videoannotationscreen.label.textbold" = "Bold";
"videoannotationscreen.label.textitalics" = "Italics";
"videoannotationscreen.label.textbolditalics" = "Bold-Italics";

// Issue Submission Form
"issuesubmissionform.label.emaildisplay" = "Email Address";
"issuesubmissionform.label.emailplaceholder" = "zylker@zohomail.com";
"issuesubmissionform.label.screenrecordingsummary" = "Screen Record Summary";
"issuesubmissionform.label.subjectdisplayname" = "Subject";
"issuesubmissionform.label.subjectplaceholder" = "Enter the subject";
"issuesubmissionform.label.addtoexistingticket" = "Add to existing ticket";
"issuesubmissionform.label.existingticketid" = "Existing Ticket ID";
"issuesubmissionform.label.enterticketidtolink" = "Enter Ticket ID to be Linked";
"issuesubmissionform.label.issuedescription" = "Issue Description";
"issuesubmissionform.label.issuemoredetails" = "Provide more details about the issue";
"issuesubmissionform.label.submityourissue" = "Submit Your Issue";
"issuesubmissionform.alert.videouploadfailed" = "Video uploading is failed. Please try again.";
"issuesubmissionform.alert.thanksmessagetitle" = "Thank you for getting in touch with us!";
"issuesubmissionform.alert.thanksmessagebody" = "Your concerns are our priority, so our support team will get in touch with you soon. Have a great day!";
"issuesubmissionform.alert.videoeditdetailuploadfailure" = "Uploading video edit details is failed. Please try again.";
"issuesubmissionform.label.entersubject" = "Please enter subject of the issue";
"issuesubmissionform.label.enteremail" = "Please enter email address";
"issuesubmissionform.label.enterexistingticketid" = "Please enter existing ticket id";
"issuesubmissionform.label.choosephoto" = "Choose Photo";
"issuesubmissionform.label.browse" = "Browse";
"issuesubmissionform.alert.accestophotodisabledgotosetting" = "Access to Photo Library is disabled. Please go to Settings and turn on Photo Library to access photos.";
"issuesubmissionform.alert.accestophotodisabledipad" = "Access to Photo Library is disabled";
"issuesubmissionform.alert.accestophotodisabledmessageipad" = "Please go to Settings and turn on Photo Library to access photos.";
"issuesubmissionform.alert.submitting" ="Submitting";
